In [1]:
# # 문제 01 유형(DataSet_01.csv 이용)
#
# 구분자 : comma(“,”), 4,572 Rows, 5 Columns, UTF-8 인코딩
#
# 글로벌 전자제품 제조회사에서 효과적인 마케팅 방법을 찾기
# 위해서 채널별 마케팅 예산과 매출금액과의 관계를 분석하고자
# 한다.
# 컬 럼 / 정 의  /   Type
# TV   /     TV 마케팅 예산 (억원)  /   Double
# Radio / 라디오 마케팅 예산 (억원)  /   Double
# Social_Media / 소셜미디어 마케팅 예산 (억원)  / Double
# Influencer / 인플루언서 마케팅
# (인플루언서의 영향력 크기에 따라 Mega / Macro / Micro /
# Nano) / String

# SALES / 매출액 / Double

In [2]:
# 1. 데이터 세트 내에 총 결측값의 개수는 몇 개인가? (답안 예시) 23

In [3]:
# 2. TV, Radio, Social Media 등 세 가지 다른 마케팅 채널의 예산과 매출액과의 상관분석을
# 통하여 각 채널이 매출에 어느 정도 연관이 있는지 알아보고자 한다.
# - 매출액과 가장 강한 상관관계를 가지고 있는 채널의 상관계수를 소수점 5번째
# 자리에서 반올림하여 소수점 넷째 자리까지 기술하시오. (답안 예시) 0.1234

In [4]:
# 3. 매출액을 종속변수, TV, Radio, Social Media의 예산을 독립변수로 하여 회귀분석을
# 수행하였을 때, 세 개의 독립변수의 회귀계수를 큰 것에서부터 작은 것 순으로
# 기술하시오.
# - 분석 시 결측치가 포함된 행은 제거한 후 진행하며, 회귀계수는 소수점 넷째 자리
# 이하는 버리고 소수점 셋째 자리까지 기술하시오. (답안 예시) 0.123

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('../Dataset/Dataset_01.csv')
df.head(3)

     TV      Radio  Social_Media Influencer       Sales
0  16.0   6.566231      2.907983       Mega   54.732757
1  13.0   9.237765      2.409567       Mega   46.677897
2  41.0  15.886446      2.913410       Mega  150.177829

In [7]:
df1 = df.copy()

In [10]:
df1.isnull().sum().sum()

26

In [11]:
# 답 : 26

In [12]:
df2 = df.copy()

In [13]:
df2.columns.to_list()

['TV', 'Radio', 'Social_Media', 'Influencer', 'Sales']

In [15]:
feature = ['TV', 'Radio', 'Social_Media', 'Sales']

In [16]:
result = df2[feature].corr().drop('Sales')['Sales']
result

TV              0.999497
Radio           0.869105
Social_Media    0.528906
Name: Sales, dtype: float64

In [18]:
round(result.abs().max(), 4)

0.9995

In [19]:
# 답 : 0.9995

In [20]:
feature2 = ['TV', 'Radio', 'Social_Media']

In [21]:
df3 = df.copy()

In [22]:
df3 = df3.dropna()

In [23]:
from statsmodels.formula.api import ols

In [24]:
form = 'Sales~' + '+'.join(feature2)

In [25]:
model = ols(form, data=df3)

In [26]:
result2 = model.fit()

In [27]:
result2.params

Intercept      -0.133963
TV              3.562570
Radio          -0.003970
Social_Media    0.004964
dtype: float64

In [28]:
result2.params.sort_values(ascending=False)

TV              3.562570
Social_Media    0.004964
Radio          -0.003970
Intercept      -0.133963
dtype: float64

In [29]:
# 답 : 3.562, 0.004, -0.003

In [30]:
from sklearn.linear_model import LinearRegression

In [41]:
model = LinearRegression(fit_intercept=True)

In [42]:
result = model.fit(df3[feature2], df3['Sales'])
result

LinearRegression()

In [43]:
result.coef_

array([ 3.56256963, -0.00397039,  0.00496402])

In [44]:
result.intercept_

-0.1339630519422883

In [45]:
# # 문제 02 유형(DataSet_02.csv 이용)
# 구분자 : comma(“,”), 200 Rows, 6 Columns, UTF-8 인코딩

# 환자의 상태와 그에 따라 처방된 약에 대한 정보를 분석하고자한다
#
# 컬 럼 / 정 의  / Type
# Age  / 연령 / Integer
# Sex / 성별 / String
# BP / 혈압 레벨 / String
# Cholesterol / 콜레스테롤 레벨 /  String
# Na_to_k / 혈액 내 칼륨에 대비한 나트륨 비율 / Double
# Drug / Drug Type / String

In [46]:
# 1.해당 데이터에 대한 EDA를 수행하고, 여성으로 혈압이 High, Cholesterol이 Normal인
# 환자의 전체에 대비한 비율이 얼마인지 소수점 네 번째 자리에서 반올림하여 소수점 셋째
# 자리까지 기술하시오. (답안 예시) 0.123

In [47]:
# 2. Age, Sex, BP, Cholesterol 및 Na_to_k 값이 Drug 타입에 영향을 미치는지 확인하기
# 위하여 아래와 같이 데이터를 변환하고 분석을 수행하시오.
# - Age_gr 컬럼을 만들고, Age가 20 미만은 ‘10’, 20부터 30 미만은 ‘20’, 30부터 40 미만은
# ‘30’, 40부터 50 미만은 ‘40’, 50부터 60 미만은 ‘50’, 60이상은 ‘60’으로 변환하시오.
# - Na_K_gr 컬럼을 만들고 Na_to_k 값이 10이하는 ‘Lv1’, 20이하는 ‘Lv2’, 30이하는 ‘Lv3’, 30
# 초과는 ‘Lv4’로 변환하시오.
# - Sex, BP, Cholesterol, Age_gr, Na_K_gr이 Drug 변수와 영향이 있는지 독립성 검정을
# 수행하시오.
# - 검정 수행 결과, Drug 타입과 연관성이 있는 변수는 몇 개인가? 연관성이 있는 변수
# 가운데 가장 큰 p-value를 찾아 소수점 여섯 번째 자리 이하는 버리고 소수점 다섯
# 번째 자리까지 기술하시오.
# (답안 예시) 3, 1.23456

In [48]:
# 3.Sex, BP, Cholesterol 등 세 개의 변수를 다음과 같이 변환하고 의사결정나무를 이용한
# 분석을 수행하시오.
# - Sex는 M을 0, F를 1로 변환하여 Sex_cd 변수 생성
# - BP는 LOW는 0, NORMAL은 1 그리고 HIGH는 2로 변환하여 BP_cd 변수 생성
# - Cholesterol은 NORMAL은 0, HIGH는 1로 변환하여 Ch_cd 생성
# - Age, Na_to_k, Sex_cd, BP_cd, Ch_cd를 Feature로, Drug을 Label로 하여 의사결정나무를
# 수행하고 Root Node의 split feature와 split value를 기술하시오.
# 이 때 split value는 소수점 셋째 자리까지 반올림하여 기술하시오. (답안 예시) Age,
# 12.345

In [49]:
df = pd.read_csv('../Dataset/Dataset_02.csv')
df.head(3)

   Age Sex    BP Cholesterol  Na_to_K   Drug
0   23   F  HIGH        HIGH   25.355  DrugY
1   47   M   LOW        HIGH   13.093  drugC
2   47   M   LOW        HIGH   10.114  drugC

In [50]:
df1 = df.copy()

In [51]:
condition1 = df1['Sex'] == 'F'
condition2 = df1['BP'] == 'HIGH'
condition3 = df1['Cholesterol'] == 'NORMAL'

In [52]:
df1 = df1[condition1 & condition2 & condition3]
df1.head(3)

    Age Sex    BP Cholesterol  Na_to_K   Drug
11   34   F  HIGH      NORMAL   19.199  DrugY
15   16   F  HIGH      NORMAL   15.516  DrugY
19   32   F  HIGH      NORMAL   25.974  DrugY

In [53]:
len(df1) / len(df)

0.105

In [57]:
temp = df[['Sex', 'BP', 'Cholesterol']].value_counts(normalize=True)
temp

Sex  BP      Cholesterol
F    HIGH    NORMAL         0.105
M    HIGH    NORMAL         0.105
     LOW     NORMAL         0.095
     NORMAL  HIGH           0.095
F    NORMAL  HIGH           0.090
M    HIGH    HIGH           0.090
F    HIGH    HIGH           0.085
M    LOW     HIGH           0.085
F    LOW     HIGH           0.070
             NORMAL         0.070
     NORMAL  NORMAL         0.060
M    NORMAL  NORMAL         0.050
dtype: float64

In [59]:
temp[('F', 'HIGH', 'NORMAL')]

0.105

In [60]:
# 답 : 0.105

In [61]:
# 2. Age, Sex, BP, Cholesterol 및 Na_to_k 값이 Drug 타입에 영향을 미치는지 확인하기
# 위하여 아래와 같이 데이터를 변환하고 분석을 수행하시오.
# - Age_gr 컬럼을 만들고, Age가 20 미만은 ‘10’, 20부터 30 미만은 ‘20’, 30부터 40 미만은
# ‘30’, 40부터 50 미만은 ‘40’, 50부터 60 미만은 ‘50’, 60이상은 ‘60’으로 변환하시오.
# - Na_K_gr 컬럼을 만들고 Na_to_k 값이 10이하는 ‘Lv1’, 20이하는 ‘Lv2’, 30이하는 ‘Lv3’, 30
# 초과는 ‘Lv4’로 변환하시오.
# - Sex, BP, Cholesterol, Age_gr, Na_K_gr이 Drug 변수와 영향이 있는지 독립성 검정을
# 수행하시오.
# - 검정 수행 결과, Drug 타입과 연관성이 있는 변수는 몇 개인가? 연관성이 있는 변수
# 가운데 가장 큰 p-value를 찾아 소수점 여섯 번째 자리 이하는 버리고 소수점 다섯
# 번째 자리까지 기술하시오.
# (답안 예시) 3, 1.23456

In [63]:
temp = df.copy()
temp.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug
0   23   F    HIGH        HIGH   25.355  DrugY
1   47   M     LOW        HIGH   13.093  drugC
2   47   M     LOW        HIGH   10.114  drugC
3   28   F  NORMAL        HIGH    7.798  drugX
4   61   F     LOW        HIGH   18.043  DrugY

In [64]:
temp['Age_gr'] = np.where(temp['Age'] < 20, 10,
                         np.where(temp['Age'] < 30, 20,
                                 np.where(temp['Age'] < 40, 30,
                                         np.where(temp['Age'] < 50, 40,
                                                 np.where(temp['Age'] < 60, 50, 60)))))

temp['Na_K_gr'] = np.where(temp['Na_to_K'] <= 10, 'Lv1',
                          np.where(temp['Na_to_K'] <= 20, 'Lv2',
                                  np.where(temp['Na_to_K'] <= 30, 'Lv3', 'Lv4')))

In [65]:
temp.columns.to_list()

['Age', 'Sex', 'BP', 'Cholesterol', 'Na_to_K', 'Drug', 'Age_gr', 'Na_K_gr']

In [66]:
var_list = ['Sex', 'BP', 'Cholesterol', 'Age_gr', 'Na_K_gr']

In [67]:
from scipy.stats import chi2_contingency

In [72]:
result = []
for i in var_list:
    table = pd.crosstab(index=temp[i], columns=temp['Drug'])
    model = chi2_contingency(table)
    result.append([model[1], i])
result = pd.DataFrame(result, columns=['pvalue', 'var'])
result

         pvalue          var
0  7.138370e-01          Sex
1  5.041733e-27           BP
2  5.962588e-04  Cholesterol
3  7.010113e-04       Age_gr
4  1.125464e-14      Na_K_gr

In [80]:
result[result.pvalue < 0.05].count()

pvalue    4
var       4
dtype: int64

In [81]:
result[result.pvalue < 0.05].max()

pvalue    0.000701
var        Na_K_gr
dtype: object

In [82]:
# 답 : 4, 0.00070

In [83]:
# 3.Sex, BP, Cholesterol 등 세 개의 변수를 다음과 같이 변환하고 의사결정나무를 이용한
# 분석을 수행하시오.
# - Sex는 M을 0, F를 1로 변환하여 Sex_cd 변수 생성
# - BP는 LOW는 0, NORMAL은 1 그리고 HIGH는 2로 변환하여 BP_cd 변수 생성
# - Cholesterol은 NORMAL은 0, HIGH는 1로 변환하여 Ch_cd 생성
# - Age, Na_to_k, Sex_cd, BP_cd, Ch_cd를 Feature로, Drug을 Label로 하여 의사결정나무를
# 수행하고 Root Node의 split feature와 split value를 기술하시오.
# 이 때 split value는 소수점 셋째 자리까지 반올림하여 기술하시오. (답안 예시) Age,
# 12.345

In [85]:
temp = df.copy()
temp.head(3)

   Age Sex    BP Cholesterol  Na_to_K   Drug
0   23   F  HIGH        HIGH   25.355  DrugY
1   47   M   LOW        HIGH   13.093  drugC
2   47   M   LOW        HIGH   10.114  drugC

In [87]:
temp['Sex_cd'] = np.where(temp['Sex'] == 'M', 0, 1)
temp['BP_cd'] = np.where(temp['BP'] == 'LOW', 0, 
                        np.where(temp['BP'] == 'NORMAL', 1, 2))
temp['Ch_cd'] = np.where(temp['Cholesterol'] == 'NORMAL', 0, 1)

In [88]:
temp.columns.to_list()

['Age',
 'Sex',
 'BP',
 'Cholesterol',
 'Na_to_K',
 'Drug',
 'Sex_cd',
 'BP_cd',
 'Ch_cd']

In [89]:
var_list = ['Age', 'Na_to_K', 'Sex_cd', 'BP_cd', 'Ch_cd']

In [90]:
from sklearn.tree import DecisionTreeClassifier, export_text

In [91]:
model = DecisionTreeClassifier()

In [92]:
result = model.fit(temp[var_list], temp['Drug'])
result

DecisionTreeClassifier()

In [97]:
export_text(result, decimals=3, feature_names=var_list)

'|--- Na_to_K <= 14.829\n|   |--- BP_cd <= 1.500\n|   |   |--- BP_cd <= 0.500\n|   |   |   |--- Ch_cd <= 0.500\n|   |   |   |   |--- class: drugX\n|   |   |   |--- Ch_cd >  0.500\n|   |   |   |   |--- class: drugC\n|   |   |--- BP_cd >  0.500\n|   |   |   |--- class: drugX\n|   |--- BP_cd >  1.500\n|   |   |--- Age <= 50.500\n|   |   |   |--- class: drugA\n|   |   |--- Age >  50.500\n|   |   |   |--- class: drugB\n|--- Na_to_K >  14.829\n|   |--- class: DrugY\n'

In [98]:
# 답 : Na_to_K, 14.829

In [99]:
# # 문제 03 유형(DataSet_03.csv 이용)
#
# 구분자 : comma(“,”), 5,001 Rows, 8 Columns, UTF-8 인코딩
# 안경 체인을 운영하고 있는 한 회사에서 고객 사진을 바탕으로 안경의 사이즈를
# 맞춤 제작하는 비즈니스를 기획하고 있다. 우선 데이터만으로 고객의 성별을
# 파악하는 것이 가능할 지를 연구하고자 한다.
#
# 컬 럼 / 정 의 / Type
# long_hair / 머리카락 길이 (0 – 길지 않은 경우 / 1 – 긴
# 경우) / Integer
# forehead_width_cm / 이마의 폭 (cm) / Double
# forehead_height_cm / 이마의 높이 (cm) / Double
# nose_wide / 코의 넓이 (0 – 넓지 않은 경우 / 1 – 넓은 경우) / Integer
# nose_long / 코의 길이 (0 – 길지 않은 경우 / 1 – 긴 경우) / Integer
# lips_thin / 입술이 얇은지 여부 0 – 얇지 않은 경우 / 1 –
# 얇은 경우) / Integer
# distance_nose_to_lip_long / 인중의 길이(0 – 인중이 짧은 경우 / 1 – 인중이
# 긴 경우) / Integer
# gender / 성별 (Female / Male) / String

In [100]:
df = pd.read_csv('../Dataset/Dataset_03.csv')
df.head(3)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
0,1,11.8,6.1,1,0,1,1,Male
1,0,14.0,5.4,0,0,1,0,Female
2,0,11.8,6.3,1,1,1,1,Male

In [101]:
# 1.이마의 폭(forehead_width_cm)과 높이(forehead_height_cm) 사이의
# 비율(forehead_ratio)에 대해서 평균으로부터 3 표준편차 밖의 경우를 이상치로
# 정의할 때, 이상치에 해당하는 데이터는 몇 개인가? (답안 예시) 10

In [102]:
df1 = df.copy()

In [103]:
df1['forehead_ratio'] = df['forehead_width_cm'] / df['forehead_height_cm']

In [104]:
mean_ratio = df1['forehead_ratio'].mean()
dtd_ratio = df1['forehead_ratio'].std()

In [105]:
condition1 = df1['forehead_ratio'].mean() + df1['forehead_ratio'].std() * 3
condition2 = df1['forehead_ratio'].mean() - df1['forehead_ratio'].std() * 3

In [106]:
condition3 = df1['forehead_ratio'] > condition1
condition4 = df1['forehead_ratio'] < condition2

In [109]:
len(df1[condition3 | condition4])

3

In [110]:
# 답 : 3

In [111]:
# 2.성별에 따라 forehead_ratio 평균에 차이가 있는지 적절한 통계 검정을 수행하시오.
# - 검정은 이분산을 가정하고 수행한다.
# - 검정통계량의 추정치는 절대값을 취한 후 소수점 셋째 자리까지 반올림하여
# 기술하시오.
# - 신뢰수준 99%에서 양측 검정을 수행하고 결과는 귀무가설 기각의 경우 Y로, 그렇지
# 않을 경우 N으로 답하시오. (답안 예시) 1.234, Y

In [112]:
df2 = df1.copy()

In [113]:
df2.head(3)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender,forehead_ratio
0,1,11.8,6.1,1,0,1,1,Male,1.934426
1,0,14.0,5.4,0,0,1,0,Female,2.592593
2,0,11.8,6.3,1,1,1,1,Male,1.873016

In [114]:
m_df = df2[df2['gender'] == 'Male']
f_df = df2[df2['gender'] == 'Female']

In [115]:
from scipy.stats import ttest_ind

In [120]:
model = ttest_ind(m_df['forehead_ratio'], f_df['forehead_ratio'], equal_var=False)
model

Ttest_indResult(statistic=2.9994984197511543, pvalue=0.0027186702390657176)

In [121]:
model.pvalue < 0.01

True

In [122]:
# 답 : 2.999, Y

In [123]:
# 3.주어진 데이터를 사용하여 성별을 구분할 수 있는지 로지스틱 회귀분석을 적용하여
# 알아 보고자 한다.
# - 데이터를 7대 3으로 나누어 각각 Train과 Test set로 사용한다. 이 때 seed는 123으로
# 한다.
# - 원 데이터에 있는 7개의 변수만 Feature로 사용하고 gender를 label로 사용한다.
# (forehead_ratio는 사용하지 않음)
# - 로지스틱 회귀분석 예측 함수와 Test dataset를 사용하여 예측을 수행하고 정확도를
# 평가한다. 이 때 임계값은 0.5를 사용한다.
# - Male의 Precision 값을 소수점 둘째 자리까지 반올림하여 기술하시오. (답안 예시)
# 0.12
#
#
# (참고)
# from sklearn.linear_model import LogisticRegression
# from sklearn.model_selection import train_test_split
# from sklearn import metrics
# train_test_split 의 random_state = 123

In [127]:
main = df.copy()

In [128]:
main.head(3)

,long_hair,forehead_width_cm,forehead_height_cm,nose_wide,nose_long,lips_thin,distance_nose_to_lip_long,gender
0,1,11.8,6.1,1,0,1,1,Male
1,0,14.0,5.4,0,0,1,0,Female
2,0,11.8,6.3,1,1,1,1,Male

In [130]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import precision_score, classification_report

In [131]:
main.columns.to_list()

['long_hair',
 'forehead_width_cm',
 'forehead_height_cm',
 'nose_wide',
 'nose_long',
 'lips_thin',
 'distance_nose_to_lip_long',
 'gender']

In [132]:
var_list = ['long_hair', 'forehead_width_cm', 'forehead_height_cm', 'nose_wide', 'nose_long', 'lips_thin', 
            'distance_nose_to_lip_long']

In [133]:
train, test = train_test_split(main, test_size=0.3, random_state=123)

In [134]:
model = LogisticRegression(random_state=123)

In [135]:
result = model.fit(train[var_list], train['gender'])
result

LogisticRegression(random_state=123)

In [136]:
pred = result.predict(test[var_list])

In [138]:
precision_score(test['gender'], pred, pos_label='Male')

0.9596354166666666

In [139]:
# 답 : 0.96

In [141]:
print(classification_report(test['gender'], pred))

              precision    recall  f1-score   support

      Female       0.97      0.96      0.96       743
        Male       0.96      0.97      0.97       758

    accuracy                           0.97      1501
   macro avg       0.97      0.97      0.97      1501
weighted avg       0.97      0.97      0.97      1501

In [142]:
# # 문제 04 유형(DataSet_04.csv 이용)
#
# 구분자 : comma(“,”), 6,718 Rows, 4 Columns, UTF-8 인코딩

# 한국인의 식생활 변화가 건강에 미치는 영향을 분석하기에 앞서 육류
# 소비량에 대한 분석을 하려고 한다. 확보한 데이터는 세계 각국의 1인당
# 육류 소비량 데이터로 아래와 같은 내용을 담고 있다.

# 컬 럼 / 정 의 / Type
# LOCATION / 국가명 / String
# SUBJECT / 육류 종류 (BEEF / PIG / POULTRY / SHEEP) / String
# TIME / 연도 (1990 ~ 2026) / Integer
# Value / 1인당 육류 소비량 (KG) / Double
# =============================================================================
# =============================================================================

# (참고)
# #1
# import pandas as pd
# import numpy as np
# #2
# from scipy.stats import ttest_rel
# #3
# from sklearn.linear_model import LinearRegression

In [143]:
df = pd.read_csv('../Dataset/Dataset_04.csv')
df.head(3)

  LOCATION SUBJECT  TIME      Value
0      AUS    BEEF  1991  27.721815
1      AUS    BEEF  1992  26.199591
2      AUS    BEEF  1993  26.169094

In [144]:
# 1.한국인의 1인당 육류 소비량이 해가 갈수록 증가하는 것으로 보여 상관분석을 통하여
# 확인하려고 한다.
# - 데이터 파일로부터 한국 데이터만 추출한다. 한국은 KOR로 표기되어 있다.
# - 년도별 육류 소비량 합계를 구하여 TIME과 Value간의 상관분석을 수행하고
# 상관계수를 소수점 셋째 자리에서 반올림하여 소수점 둘째 자리까지만 기술하시오.
# (답안 예시) 0.55

In [145]:
df_kor = df.copy()

In [146]:
df_kor = df_kor[df_kor['LOCATION'] == 'KOR']

In [156]:
table = df_kor.groupby('TIME')['Value'].sum().reset_index()
table.head(3)

   TIME      Value
0  1990   5.774255
1  1991  21.911207
2  1992  26.901769

In [157]:
table.corr()

           TIME     Value
TIME   1.000000  0.960124
Value  0.960124  1.000000

In [158]:
# 답 : 0.96

In [159]:
# 2. 한국 인근 국가 가운데 식생의 유사성이 상대적으로 높은 일본(JPN)과 비교하여, 연도별
# 소비량에 평균 차이가 있는지 분석하고자 한다.
# - 두 국가의 육류별 소비량을 연도기준으로 비교하는 대응표본 t 검정을 수행하시오.
# - 두 국가 간의 연도별 소비량 차이가 없는 것으로 판단할 수 있는 육류 종류를 모두
# 적으시오. (알파벳 순서) (답안 예시) BEEF, PIG, POULTRY, SHEEP

In [189]:
main = df.copy()

In [191]:
condition1 = main['LOCATION'] == 'JPN'
condition2 = main['LOCATION'] == 'KOR'
main = main[condition1 | condition2]

In [193]:
df.SUBJECT.unique()

array(['BEEF', 'PIG', 'POULTRY', 'SHEEP'], dtype=object)

In [194]:
var_list = ['BEEF', 'PIG', 'POULTRY', 'SHEEP']

In [197]:
main.head(3)

    LOCATION SUBJECT  TIME     Value
294      JPN    BEEF  1990  6.111035
295      JPN    BEEF  1991  6.517055
296      JPN    BEEF  1992  6.766244

In [200]:
base = pd.pivot_table(main, index='TIME', columns='LOCATION', values='Value', aggfunc='sum')
base.head()

LOCATION        JPN        KOR
TIME
1990      32.931602   5.774255
1991      32.584528  21.911207
1992      33.218385  26.901769
1993      33.355064  26.938255
1994      34.043920  27.877341

In [196]:
from scipy.stats import ttest_rel

In [206]:
result = []
for i in var_list:
    temp = main[main['SUBJECT'] == i]
    table = pd.pivot_table(temp, index='TIME', columns='LOCATION', values='Value', aggfunc='sum').dropna()
    result.append([i, ttest_rel(table['JPN'], table['KOR'])[1]])
result= pd.DataFrame(result, columns=['var', 'pvalue'])
result

       var        pvalue
0     BEEF  3.541916e-04
1      PIG  1.063500e-10
2  POULTRY  4.690626e-01
3    SHEEP  4.346643e-05

In [207]:
result[result.pvalue >= 0.05]

       var    pvalue
2  POULTRY  0.469063

In [208]:
# 답 : POULTRY

In [209]:
# 3.(한국만 포함한 데이터에서) Time을 독립변수로, Value를 종속변수로 하여 육류
# 종류(SUBJECT) 별로 회귀분석을 수행하였을 때, 가장 높은 결정계수를 가진 모델의
# 학습오차 중 MAPE를 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 21.12
# (MAPE : Mean Absolute Percentage Error, 평균 절대 백분율 오차)
# (MAPE = Σ ( | y - y ̂ | / y ) * 100/n ))

In [210]:
kor_df = df.copy()

In [211]:
kor_df = kor_df[kor_df['LOCATION']=='KOR']

In [212]:
var_list

['BEEF', 'PIG', 'POULTRY', 'SHEEP']

In [213]:
from sklearn.linear_model import LinearRegression

In [218]:
result = []
for i in var_list:
    temp = kor_df[kor_df['SUBJECT'] == i]
    model = LinearRegression()
    final = model.fit(temp[['TIME']], temp['Value'])
    r2 = final.score(temp[['TIME']], temp['Value'])
    pred = final.predict(temp[['TIME']])
    mape = (abs(temp['Value'] - pred) / temp['Value']).sum() * 100 / len(temp)
    result.append([i, r2, mape])
result = pd.DataFrame(result, columns=['var', 'r2', 'mape'])
result

       var        r2       mape
0     BEEF  0.835456   7.310893
1      PIG  0.940681   5.634980
2  POULTRY  0.951498   5.783358
3    SHEEP  0.004083  33.347966

In [219]:
result.r2.idxmax()

2

In [220]:
# 답 : 5.78

In [221]:
# # 문제 05 유형(DataSet_05.csv 이용)
#
# 구분자 : comma(“,”), 8,068 Rows, 12 Columns, UTF-8 인코딩
#
# A자동차 회사는 신규 진입하는 시장에 기존 모델을 판매하기 위한 마케팅 전략을
# 세우려고 한다. 기존 시장과 고객 특성이 유사하다는 전제 하에 기존 고객을 세분화하여
# 각 그룹의 특징을 파악하고, 이를 이용하여 신규 진입 시장의 마케팅 계획을
# 수립하고자 한다. 다음은 기존 시장 고객에 대한 데이터이다.
#

# 컬 럼 / 정 의 / Type
# ID / 고유 식별자 / Double
# Age / 나이 / Double
# Age_gr / 나이 그룹 (10/20/30/40/50/60/70) / Double
# Gender / 성별 (여성 : 0 / 남성 : 1) / Double
# Work_Experience / 취업 연수 (0 ~ 14) / Double
# Family_Size / 가족 규모 (1 ~ 9) / Double
# Ever_Married / 결혼 여부 (Unknown : 0 / No : 1 / Yes : 2) / Double
# Graduated / 재학 중인지 여부 / Double
# Profession / 직업 (Unknown : 0 / Artist ~ Marketing 등 9개) / Double
# Spending_Score / 소비 점수 (Average : 0 / High : 1 / Low : 2) / Double
# Var_1 / 내용이 알려지지 않은 고객 분류 코드 (0 ~ 7) / Double
# Segmentation / 고객 세분화 결과 (A ~ D) / String
# =============================================================================
# =============================================================================


# (참고)
# 1
# import pandas as pd
# #2
# from scipy.stats import chi2_contingency
# #3
# from sklearn.model_selection import train_test_split
# from sklearn import metrics
# from sklearn.tree import DecisionTreeClassifier
# from sklearn.tree import export_graphviz
# import pydot

In [222]:
df = pd.read_csv('../Dataset/Dataset_05.csv')
df.head(3)

,ID,Age,Age_gr,Gender,Work_Experience,Family_Size,Ever_Married,Graduated,Profession,Spending_Score,Var_1,Segmentation
0,462809,22,30,1,1.0,4.0,1,1,6,2,4,NaN
1,462643,38,40,0,NaN,3.0,2,2,3,0,4,A
2,466315,67,70,0,1.0,1.0,2,2,3,2,6,NaN

In [223]:
# 1.위의 표에 표시된 데이터 타입에 맞도록 전처리를 수행하였을 때, 데이터 파일 내에
# 존재하는 결측값은 모두 몇 개인가? 숫자형 데이터와 문자열 데이터의 결측값을
# 모두 더하여 답하시오.
# (String 타입 변수의 경우 White Space(Blank)를 결측으로 처리한다) (답안 예시) 123

In [224]:
df1 = df.copy()

In [225]:
df1.isnull().sum().sum()

1166

In [226]:
# 답 : 1166

In [227]:
# 2.이어지는 분석을 위해 결측값을 모두 삭제한다. 그리고, 성별이 세분화(Segmentation)에
# 영향을 미치는지 독립성 검정을 수행한다. 수행 결과, p-value를 반올림하여 소수점
# 넷째 자리까지 쓰고, 귀무가설을 기각하면 Y로, 기각할 수 없으면 N으로 기술하시오.
# (답안 예시) 0.2345, N

In [228]:
df2 = df.copy()

In [229]:
df2 = df2.dropna()

In [231]:
main = df2.copy

In [232]:
table = pd.crosstab(index=df2.Gender, columns=df2.Segmentation)
table

Segmentation    A    B    C     D
Gender
0             784  759  826   772
1             909  872  953  1092

In [233]:
from scipy.stats import chi2_contingency

In [235]:
result = chi2_contingency(table)
result

(13.84425336760869,
 0.003125001283622576,
 3,
 array([[ 763.27156595,  735.31950624,  802.04377781,  840.36514999],
        [ 929.72843405,  895.68049376,  976.95622219, 1023.63485001]]))

In [236]:
result[1] < 0.05

True

In [237]:
round(result[1], 4)

0.0031

In [238]:
# 답 : 0.0031, Y

In [239]:
# 3.Segmentation 값이 A 또는 D인 데이터만 사용하여 의사결정 나무 기법으로 분류
# 정확도를
# 측정해 본다.
# - 결측치가 포함된 행은 제거한 후 진행하시오.
# - Train대 Test 7대3으로 데이터를 분리한다. (Seed = 123)
# - Train 데이터를 사용하여 의사결정나무 학습을 수행하고, Test 데이터로 평가를
# 수행한다.
# - 의사결정나무 학습 시, 다음과 같이 설정하시오:
# • Feature: Age_gr, Gender, Work_Experience, Family_Size,
#             Ever_Married, Graduated, Spending_Score
# • Label : Segmentation
# • Parameter : Gini / Max Depth = 7 / Seed = 123
# 이 때 전체 정확도(Accuracy)를 소수점 셋째 자리 이하는 버리고 소수점 둘째자리까지
# 기술하시오.
# (답안 예시) 0.12

In [267]:
df3 = df2.copy()

In [268]:
condition1 = (df3['Segmentation'] == 'A')
condition2 = (df3['Segmentation'] == 'D')

In [269]:
df3 = df3[condition1 | condition2]
df3.head(3)

,ID,Age,Age_gr,Gender,Work_Experience,Family_Size,Ever_Married,Graduated,Profession,Spending_Score,Var_1,Segmentation
7,464347,33,40,0,1.0,3.0,1,2,6,2,6,D
8,465015,61,70,0,0.0,3.0,2,2,3,2,7,D
10,464041,26,30,0,1.0,3.0,1,2,3,2,6,A

In [271]:
from sklearn.tree import DecisionTreeClassifier, export_text
from sklearn.model_selection import train_test_split

In [273]:
df3.columns.to_list()

['ID',
 'Age',
 'Age_gr',
 'Gender',
 'Work_Experience',
 'Family_Size',
 'Ever_Married',
 'Graduated',
 'Profession',
 'Spending_Score',
 'Var_1',
 'Segmentation']

In [274]:
var_list = ['Age_gr', 'Gender', 'Work_Experience', 'Family_Size', 'Ever_Married', 'Graduated', 'Spending_Score']

In [275]:
train, test = train_test_split(df3, test_size=0.3, random_state=123)

In [276]:
model = DecisionTreeClassifier(max_depth=7, random_state=123)

In [278]:
result = model.fit(train[var_list], train['Segmentation'])
result

DecisionTreeClassifier(max_depth=7, random_state=123)

In [281]:
result.score(test[var_list], test['Segmentation'])

0.6807116104868914

In [282]:
# 답 : 0.68